<?php

namespace Database\Seeders;

use App\Models\Category;
use App\Models\SubCategory;
use App\Models\User;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    public $data = [
        'การพัฒนา' => [
            'การพัฒนาเว็บ',
            'วิทยาศาสตร์ข้อมูล',
            'การพัฒนามือถือ',
            'ภาษาการเขียนโปรแกรม',
            'การพัฒนาเกม',
            'การออกแบบและการพัฒนาฐานข้อมูล',
            'การทดสอบซอฟต์แวร์',
            'วิศวกรรมซอฟต์แวร์',
            'เครื่องมือพัฒนาซอฟต์แวร์',
            'No-Code Development'
        ],
        'ธุรกิจ' => [
            'การเป็นผู้ประกอบการ',
            'การสื่อสาร',
            'การจัดการ',
            'การขาย',
            'กลยุทธ์ทางธุรกิจ',
            'การดำเนินงาน',
            'การจัดการโครงการ',
            'กฎหมายธุรกิจ',
            'ระบบธุรกิจอัจฉริยะและการวิเคราะห์',
            'ทรัพยากรบุคคล',
            'อุตสาหกรรม',
            'อีคอมเมิร์ซ',
            'สื่อ',
            'อสังหาริมทรัพย์',
            'ธุรกิจอื่นๆ'
        ],
        'การเงินและการบัญชี' => [
            'การบัญชีและการทำบัญชี',
            'คริปโทเคอร์เรนซีและบล็อกเชน',
            'การเงิน',
            'ใบรับรองด้านการเงินและการเตรียมสอบ',
            'การสร้างแบบจำลองทางการเงินและการวิเคราะห์',
            'การลงทุนและการค้า',
            'การปฏิบัติตามข้อกาหนด',
            'เศรษฐศาสตร์',
            'เครื่องมือจัดการด้านการเงิน',
            'ภาษี',
            'การเงินและการบัญชีอื่นๆ'
        ],
        'ไอทีและซอฟต์แวร์' => [
            'การรับรองมาตรฐานไอที',
            'เครื่อข่ายและความปลอดภัย',
            'ฮาร์ดแวร์',
            'ระบบปฏิบัติการและเซิร์ฟเวอร์',
            'ไอทีและซอฟต์แวร์อื่นๆ'
        ],
        'การทำงานในสำนักงาน' => [
            'Microsoft',
            'Apple',
            'Google',
            'SAP',
            'Oracle',
            'การทำงานในสำนักงานอื่นๆ',
        ],
        'การพัฒนาตนเอง' => [
            'การเปลี่ยนแปลงตนเอง',
            'การเพิ่มผลิตภาพตนเอง',
            'ความเป็นผู้นำ',
            'การพัฒนาอาชีพ',
            'การอบรมเลี้ยงดูและความสัมพันธ์',
            'ความสุข',
            'ศาสนาและจิตวิญญาณ',
            'การสร้างแบรนด์ส่วนตัว',
            'ความคิดสร้างสรรค์',
            'อิทธิพล',
            'การเห็นคุณค่าในตนเองและความมั่นใจ',
            'การจัดการความเครียด',
            'ทักษะด้านความจำและการเรียน',
            'แรงจูงใจ',
            'การพัฒนาตนเองอื่นๆ',
        ],
        'การออกแบบ' => [
            'การออกแบบเว็บไซต์',
            'การออกแบบกราฟิกและภาพประกอบ',
            'เครื่องมือออกแบบ',
            'การออกแบบประสบการณ์ผู้ใช้',
            'การออกแบบเกม',
            '3D และภาพเคลื่อนไหว',
            'การออกแบบแฟชั่น',
            'ออกแบบสถาปัตยกรรม',
            'ออกแบบภายใน',
            'การออกแบบอื่นๆ',
        ],
        'การตลาด' => [
            'การตลาดดิจิตอล',
            'การเพิ่มประสิทธิภาพเครื่องมือค้นหา',
            'การตลาดบนสื่อสังคมออนไลน์',
            'การสร้างแบรนด์',
            'พื้นฐานการตลาด',
            'การวิเคราะห์การตลาดและระบบอัตโนมัติ',
            'ประชาสัมพันธ์',
            'การโฆษณาแบบชำระเงิน',
            'การตลาดด้านวิดีโอและมือถือ',
            'การทำการตลาดให้เนื้อหา',
            'Growth Hacking',
            'การตลาดพันธมิตร',
            'การทำตลาดให้กับผลิตภัณฑ์',
            'การตลาดอื่นๆ',
        ],
        'ไลฟ์สไตล์' => [
            'ศิลปะและงานฝีมือ',
            'ความงามและเมคอัพ',
            'Esoteric Practices',
            'อาหารและเครื่องดื่ม',
            'การเล่นเกม',
            'การตกแต่งบ้านและการจัดสวน',
            'การดูแลและฝึกสัตว์เลี้ยง',
            'ท่องเที่ยว',
            'ไลฟ์สไตล์อื่นๆ',
        ],
        'การถ่ายภาพและวิดีโอ' => [
            'การถ่ายภาพดิจิทัล',
            'การถ่ายภาพ',
            'การถ่ายภาพบุคคล',
            'เครื่องมือถ่ายภาพ',
            'การถ่ายภาพเชิงพาณิชย์',
            'การออกแบบวิดีโอ',
            'การถ่ายภาพและวิดีโออื่นๆ',
        ],
        'สุขภาพและความแข็งแรง' => [
            'ความแข็งแรง',
            'สุขภาพทั่วไป',
            'กีฬา',
            'โภชนาการและอาหาร',
            'โยคะ',
            'สุขภาพจิต',
            'ศิลปะการต่อสู้และการป้องกันตัว',
            'ความปลอดภัยและการปฐมพยาบาล',
            'เต้น',
            'การทำสมาธิ',
            'สุขภาพและความแข็งแรงอื่นๆ',
        ],
        'ดนตรี' => [
            'อุปกรณ์',
            'การผลิตเพลง',
            'ดนตรีพื้นฐาน',
            'เสียง',
            'เทคนิคดนตรี',
            'ซอฟต์แวร์ดนตรี',
            'ดนตรีอื่นๆ',
        ],
        'การสอนและวิชาการ' => [
            'วิศวกรรม',
            'มนุษยศาสตร์',
            'คณิตศาสตร์',
            'การศึกษาออนไลน์',
            'วิทยาศาสตร์',
            'สังคมศาสตร์',
            'การเรียนภาษา',
            'การฝึกอบรมวิทยากร',
            'เตรียมทดสอบ',
            'การสอนและวิชาการอื่นๆ',
        ],
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        return collect($this->data)->each(function ($sub, $key) {
            $data['name'] = $key;
            $create = Category::create($data);
            collect($sub)->each(function ($value) use ($create) {
                $data['category_id'] = $create->id;
                $data['name'] = $value;
                SubCategory::create($data);
            });
        });
    }
}
